// Lab_03_3
// Лукашевич Андрій
// Лабораторна робота № 3.3
//  Розгалуження, задане графіком функції
// Варіант 12

const x = +prompt('x = '); // Запрошуємо ввід значення вхідного параметру х
const R = +prompt('R = '); // Запрошуємо ввід значення вхідного параметру R

let y; // Результат обчислень;

if (x <= -6) {
  y = R;
} else if (x > -6 && x <= -R) {
  y = (x - R) / (R + 6); 
} else if (x > -R && x <= 0) {
  y = R - sqrt(R ** 2 - (x + R) ** 2);
} else if (x > 0 && x <= R) {
  y = Math.sqrt(R ** 2 - x ** 2);
} else if (x > R) {
  y = (-x + R) / (1 + R);
}

console.log(y);
